Revit 2024 API
SpatialElement Class
 Represents an enclosed area or volume in the Revit model.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public class SpatialElement : Element
Visual Basic
Public Class SpatialElement _
	Inherits Element
Visual C++
public ref class SpatialElement : public Element
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.SpatialElement
 Autodesk.Revit.DB.Architecture.Room
 Autodesk.Revit.DB.Area
 Autodesk.Revit.DB.Mechanical.Space
See Also
SpatialElement Members
Autodesk.Revit.DB Namespace